---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.SiteAngle
source: html/a2c5f07b-9fbf-5b72-9ba9-ddfaba202b17.htm
---
# Autodesk.Revit.DB.SpecTypeId.SiteAngle Property

Site Angle, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId SiteAngle { get; }
```